docs/leets/0104-Maximum-Depth-of-Binary-Tree.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 
</div>
<div id="content" class="content">
<div id="outline-container-orgde74eb5" class="outline-2">
<h2 id="orgde74eb5">104. Maximum Depth of Binary Tree</h2>
<div class="outline-text-2" id="text-orgde74eb5">
</div>

<div id="outline-container-org15c5345" class="outline-3">
<h3 id="org15c5345">Problem:</h3>
<div class="outline-text-3" id="text-org15c5345">
<p>
Given the root of a binary tree, return its maximum depth. The maximum depth is the number of nodes along the longest path from the root node down to the farthest leaf node.
</p>
</div>
</div>

<div id="outline-container-org148c2c3" class="outline-3">
<h3 id="org148c2c3">Solution Description:</h3>
<div class="outline-text-3" id="text-org148c2c3">
<p>
To implement the solution for finding the maximum depth of a binary tree, we need to use a depth-first search (DFS) approach. Every time we traverse down a node, we increase our depth count. We need to check both left and right subtrees to find the maximum depth from the current node.
</p>

<p>
Here's a step-by-step plan:
</p>
<ol class="org-ol">
<li>If the current node is null, that contributes 0 to the depth.</li>
<li>Otherwise, compute the depth of the left and right subtrees.</li>
<li>The depth of the current node is 1 plus the maximum of the depths of the left and right subtrees.</li>
<li>Return this computed depth.</li>
</ol>

<p>
Time Complexity: O(N), where N is the number of nodes in the tree. We have to visit each node once.
Space Complexity: O(H), where H is the height of the tree. This is due to the recursion stack.
</p>
</div>
</div>

<div id="outline-container-org2bd0c0a" class="outline-3">
<h3 id="org2bd0c0a">Example:</h3>
<div class="outline-text-3" id="text-org2bd0c0a">
<p>
Consider the binary tree:
</p>

<p>
```
      3
     / \
    9  20
      /  \
     15   7
```
</p>

<p>
The maximum depth of this tree is 3.
</p>
</div>
</div>

<div id="outline-container-org0cd40dd" class="outline-3">
<h3 id="org0cd40dd">Setup:</h3>
<div class="outline-text-3" id="text-org0cd40dd">
<p>
Here is a skeleton code for implementing the solution. An additional helper function can also be included for testing purposes using examples.
</p>

<pre class="example">
Test Case 1: Passed (Expected: 3, Got: 3)
Test Case 2: Passed (Expected: 2, Got: 2)
Test Case 3: Passed (Expected: 1, Got: 1)
Test Case 4: Passed (Expected: 0, Got: 0)
Test Case 5: Passed (Expected: 4, Got: 4)
undefined
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
